ЕРПУХАстенд.cbr_Основной/src/InformationRegisters/cbr_ОстаткиНоменклатурыПоСоглашениюСведений/cbr_ОстаткиНоменклатурыПоСоглашениюСведений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_ОстаткиНоменклатурыПоСоглашениюСведений</name>
  <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
  <resources>
    <name>Количество</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗаказКлиента</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <dimensions>
    <name>Соглашение</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДвижения</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <type>
      <types>EnumRef.cbr_ВидыДвиженияСоглашенияСКлиентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЕРПУХАстенд.cbr_Основной/src/AccumulationRegisters/cbr_ОстаткиНоменклатурыПоСоглашению/cbr_ОстаткиНоменклатурыПоСоглашению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>cbr_ОстаткиНоменклатурыПоСоглашению</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСКлиентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ЕРПУХАстенд.cbr_Основной/src/Enums/cbr_ВидыДвиженияСоглашенияСКлиентами/cbr_ВидыДвиженияСоглашенияСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>cbr_ВидыДвиженияСоглашенияСКлиентами</name>
  <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
  <enumValues>
    <name>Приход</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
  </enumValues>
  <enumValues>
    <name>Расход</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
  </enumValues>
</mdclass:Enum>

ЕРПУХАстенд.cbr_Основной/src/Catalogs/СоглашенияСКлиентами/СоглашенияСКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="2bb5c12e-1217-4c8d-ae01-3a6253cfe429">
  <name>СоглашенияСКлиентами</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>cbr_Проект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ДокументыДляВодителя</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТаможенноеСопровождение</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_УсловияДоставки</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТребованияКУпаковке</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТребованияКЭтикетке</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ТребованиеККомплектации</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_НеБолееДатыПроизводства</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ДопустимыйОстатокГСХНеМенееПроцент</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ДопустимыйОстатокГСХНеМенееМес</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ПрочиеТребования</name>
    <comment>//++АшаеваАН 29.01.26 ПРД.5</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_АгентскоеВознаграждение</name>
    <comment>//++ Тусеев ПРД12</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>cbr_МаксимальнаяРучнаяСкидка</name>
    <comment>//++ БаженоваЕО 27.02.2026 ПРД.21</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ПроцентТУ</name>
    <comment>//++ БаженоваЕО 27.02.2026 ПРД.21</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_МаксимальнаяРучная</name>
    <comment>//++ БаженоваЕО 27.02.2026 ПРД.21</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>cbr_ПроцентАВ</name>
    <comment>//++ БаженоваЕО 27.02.2026 ПРД.21</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>cbr_АгентскиеВознаграждения</name>
    <comment>//++ Тусеев ПРД12</comment>
    <attributes>
      <name>Агент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорАгента</name>
      <type>
        <types>DocumentRef.ВерсияСоглашенияКоммерческийДоговор</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаАВ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>cbr_ЦеныПоТоварам</name>
    <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрцентРучнаяСкидка</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРучнаяСкидка</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСоСкидкой</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикиИспользуются</name>
      <comment>//AlopinAS 28.01.2026 ПРД.20</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>cbr_РесурсныеСпецификации</name>
    <attributes>
      <name>РесурснаяСпецификация</name>
      <type>
        <types>CatalogRef.РесурсныеСпецификации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЕРПУХАстенд.cbr_Основной/src/InformationRegisters/cbr_ОстаткиНоменклатурыПоСоглашениюСведений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//++AlopinAS 28.01.2026 ПРД.20
Функция ДобавитьЗаписи(Ссылка) Экспорт

	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Результат = ОбработатьЗаказКлиента(Ссылка);
	КонецЕсли;

	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.СоглашенияСКлиентами") Тогда
		Результат = ОбработатьСоглашение(Ссылка);
	КонецЕсли;

	Возврат Результат;

КонецФункции
//--AlopinAS 28.01.2026 ПРД.20

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти
#Область СлужебныеПроцедурыИФункции

//++AlopinAS 28.01.2026 ПРД.20
Функция ОбработатьЗаказКлиента(Ссылка)

	РезультатЗапроса = ПолучитьТекущиеДанныеТЧЦеныПоТоварамИзЗаказа(Ссылка);

	СоглашениеСсылка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Соглашение");

	НачатьТранзакцию();
	Попытка

		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.Соглашение.Установить(СоглашениеСсылка);

		Набор.Отбор.ВидДвижения.Установить(ПредопределенноеЗначение(
				"Перечисление.cbr_ВидыДвиженияСоглашенияСКлиентами.Расход"));
		Набор.Прочитать();
		Для Каждого Стр Из Набор Цикл
			Если Стр.ЗаказКлиента = Ссылка Тогда
				Набор.Удалить(Стр);
			КонецЕсли;
		КонецЦикла;

		Для Каждого Стр Из РезультатЗапроса Цикл
			НоваяСтрока = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		КонецЦикла;
		Набор.Записать();
		РезультатПроверки = ПроверитьНаличиеПревышенияПоОстаткам(СоглашениеСсылка);

		Если РезультатПроверки Тогда
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Произошла ошибка при записи в регистр!'"));		
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
КонецФункции
//--AlopinAS 28.01.2026 ПРД.20

//++AlopinAS 28.01.2026 ПРД.20
Функция ОбработатьСоглашение(Ссылка)
	РезультатЗапроса = ПолучитьТекущиеДанныеТЧЦеныПоТоварам(Ссылка);

	НачатьТранзакцию();
	Попытка

		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.Соглашение.Установить(Ссылка);
		Набор.Отбор.ВидДвижения.Установить(ПредопределенноеЗначение(
				"Перечисление.cbr_ВидыДвиженияСоглашенияСКлиентами.Приход"));
		Набор.Прочитать();
		Набор.Очистить();
		Набор.Загрузить(РезультатЗапроса);
		Набор.Записать();

		РезультатПроверки = ПроверитьНаличиеПревышенияПоОстаткам(Ссылка);

		Если РезультатПроверки Тогда
			ОтменитьТранзакцию();
			Возврат Ложь;
		КонецЕсли;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Произошла ошибка при записи в регистр!'"));
		Возврат Ложь;
	КонецПопытки;
	Возврат Истина;
КонецФункции
//--AlopinAS 28.01.2026 ПРД.20

//++AlopinAS 28.01.2026 ПРД.20
Функция ПолучитьТекущиеДанныеТЧЦеныПоТоварам(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Номенклатура КАК Номенклатура,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Характеристика КАК Характеристика,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Количество КАК Количество,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка КАК Соглашение,
	|	ЗНАЧЕНИЕ(Перечисление.cbr_ВидыДвиженияСоглашенияСКлиентами.Приход) КАК ВидДвижения,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаНачала КАК ДатаНачала,
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Справочник.СоглашенияСКлиентами.cbr_ЦеныПоТоварам КАК СоглашенияСКлиентамиcbr_ЦеныПоТоварам
	|ГДЕ
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Ссылка = &Ссылка
	|	И СоглашенияСКлиентамиcbr_ЦеныПоТоварам.Количество > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	СоглашенияСКлиентамиcbr_ЦеныПоТоварам.НомерСтроки";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса;
КонецФункции
//--AlopinAS 28.01.2026 ПРД.20

//++AlopinAS 28.01.2026 ПРД.20
Функция ПроверитьНаличиеПревышенияПоОстаткам(СоглашениеСсылка)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	cbr_ОстаткиНоменклатурыПоСоглашению.Номенклатура КАК Номенклатура,
	|	cbr_ОстаткиНоменклатурыПоСоглашению.Характеристика КАК Характеристика,
	|	cbr_ОстаткиНоменклатурыПоСоглашению.ВидДвижения КАК ВидДвижения,
	|	cbr_ОстаткиНоменклатурыПоСоглашению.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	cbr_ОстаткиНоменклатурыПоСоглашению.Количество КАК Количество,
	|	cbr_ОстаткиНоменклатурыПоСоглашению.ДатаНачала КАК ДатаНачала,
	|	cbr_ОстаткиНоменклатурыПоСоглашению.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТРегистр
	|ИЗ
	|	РегистрСведений.cbr_ОстаткиНоменклатурыПоСоглашению КАК cbr_ОстаткиНоменклатурыПоСоглашению
	|ГДЕ
	|	cbr_ОстаткиНоменклатурыПоСоглашению.Соглашение = &Соглашение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРегистр.Номенклатура КАК Номенклатура,
	|	ВТРегистр.Характеристика КАК Характеристика,
	|	ВТРегистр.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ВТРегистр.Количество) КАК Количество,
	|	ВТРегистр.ДатаНачала КАК ДатаНачала,
	|	ВТРегистр.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТПриход
	|ИЗ
	|	ВТРегистр КАК ВТРегистр
	|ГДЕ
	|	ВТРегистр.ВидДвижения = &ВидДвиженияПлюс
	|СГРУППИРОВАТЬ ПО
	|	ВТРегистр.Номенклатура,
	|	ВТРегистр.Характеристика,
	|	ВТРегистр.ЕдиницаИзмерения,
	|	ВТРегистр.ДатаНачала,
	|	ВТРегистр.ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРегистр.Номенклатура КАК Номенклатура,
	|	ВТРегистр.Характеристика КАК Характеристика,
	|	ВТРегистр.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	СУММА(ВТРегистр.Количество) КАК Количество,
	|	ВТРегистр.ДатаНачала КАК ДатаНачала,
	|	ВТРегистр.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТРасход
	|ИЗ
	|	ВТРегистр КАК ВТРегистр
	|ГДЕ
	|	ВТРегистр.ВидДвижения = &ВидДвиженияРасход
	|СГРУППИРОВАТЬ ПО
	|	ВТРегистр.Номенклатура,
	|	ВТРегистр.Характеристика,
	|	ВТРегистр.ЕдиницаИзмерения,
	|	ВТРегистр.ДатаНачала,
	|	ВТРегистр.ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТПриход.Номенклатура, ВТРасход.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВТПриход.Характеристика, ВТРасход.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ВТПриход.ЕдиницаИзмерения, ВТРасход.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|	-(ЕСТЬNULL(ВТПриход.Количество, 0) - ЕСТЬNULL(ВТРасход.Количество, 0)) КАК Превышение,
	|	ЕСТЬNULL(ВТПриход.ДатаНачала, ВТРасход.ДатаНачала) КАК ДатаНачала,
	|	ЕСТЬNULL(ВТПриход.ДатаОкончания, ВТРасход.ДатаОкончания) КАК ДатаОкончания
	|ИЗ
	|	ВТПриход КАК ВТПриход
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТРасход КАК ВТРасход
	|		ПО ВТПриход.Номенклатура = ВТРасход.Номенклатура
	|		И ВТПриход.Характеристика = ВТРасход.Характеристика
	|		И ВТПриход.ЕдиницаИзмерения = ВТРасход.ЕдиницаИзмерения
	|		И ВТПриход.ДатаНачала = ВТРасход.ДатаНачала
	|		И ВТПриход.ДатаОкончания = ВТРасход.ДатаОкончания
	|ГДЕ
	|	-(ЕСТЬNULL(ВТПриход.Количество, 0) - ЕСТЬNULL(ВТРасход.Количество, 0)) > 0";

	Запрос.УстановитьПараметр("Соглашение", СоглашениеСсылка);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", ПредопределенноеЗначение(
		"Перечисление.cbr_ВидыДвиженияСоглашенияСКлиентами.Расход"));
	Запрос.УстановитьПараметр("ВидДвиженияПлюс", ПредопределенноеЗначение(
		"Перечисление.cbr_ВидыДвиженияСоглашенияСКлиентами.Приход"));

	РезультатЗапроса = Запрос.Выполнить();

	РезультатПроверки = Ложь;

	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Превышение остатка по номенклатуре %1 на количество %2",
				ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.Превышение));
		КонецЦикла;
		РезультатПроверки = Истина;
	КонецЕсли;

	Возврат РезультатПроверки;
КонецФункции
//--AlopinAS 28.01.2026 ПРД.20

//++AlopinAS 28.01.2026 ПРД.20
Функция ПолучитьТекущиеДанныеТЧЦеныПоТоварамИзЗаказа(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
	|	ЗНАЧЕНИЕ(Перечисление.cbr_ВидыДвиженияСоглашенияСКлиентами.Расход) КАК ВидДвижения,
	|	ВЫБОР
	|		КОГДА ЗаказКлиентаТовары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА НоменклатураСправочник.ЕдиницаИзмерения
	|		ИНАЧЕ ЗаказКлиентаТовары.Упаковка
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	ЗаказКлиентаТовары.Количество КАК Количество,
	|	ЗаказКлиента.Соглашение КАК Соглашение,
	|	ЗаказКлиента.Ссылка КАК ЗаказКлиента,
	|	ЗаказКлиентаТовары.ДатаОтгрузки КАК ДатаОтгрузки
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураСправочник
	|		ПО ЗаказКлиентаТовары.Номенклатура = НоменклатураСправочник.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО ЗаказКлиентаТовары.Ссылка = ЗаказКлиента.Ссылка
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТТовары.Соглашение КАК Соглашение,
	|	ВТТовары.Номенклатура КАК Номенклатура,
	|	ВТТовары.Характеристика КАК Характеристика,
	|	ВТТовары.ВидДвижения КАК ВидДвижения,
	|	ВТТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТТовары.Количество КАК Количество,
	|	ВТТовары.ЗаказКлиента КАК ЗаказКлиента,
	|	cbr_ОстаткиНоменклатурыПоСоглашению.ДатаНачала КАК ДатаНачала,
	|	cbr_ОстаткиНоменклатурыПоСоглашению.ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	РегистрСведений.cbr_ОстаткиНоменклатурыПоСоглашению КАК cbr_ОстаткиНоменклатурыПоСоглашению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТовары КАК ВТТовары
	|		ПО cbr_ОстаткиНоменклатурыПоСоглашению.Соглашение = ВТТовары.Соглашение
	|		И cbr_ОстаткиНоменклатурыПоСоглашению.Номенклатура = ВТТовары.Номенклатура
	|		И cbr_ОстаткиНоменклатурыПоСоглашению.Характеристика = ВТТовары.Характеристика
	|		И cbr_ОстаткиНоменклатурыПоСоглашению.ЕдиницаИзмерения = ВТТовары.ЕдиницаИзмерения
	|		И
	|			cbr_ОстаткиНоменклатурыПоСоглашению.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.cbr_ВидыДвиженияСоглашенияСКлиентами.Приход)
	|		И ВТТовары.ДатаОтгрузки
	|			МЕЖДУ cbr_ОстаткиНоменклатурыПоСоглашению.ДатаНачала И cbr_ОстаткиНоменклатурыПоСоглашению.ДатаОкончания";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса;
КонецФункции
//--AlopinAS 28.01.2026 ПРД.20
#КонецОбласти

#КонецЕсли
